[
  {"palavra": "python", "dica": "Linguagem popular conhecida por sua sintaxe simples e bibliotecas poderosas para ciência de dados e automação."},
  {"palavra": "javascript", "dica": "Linguagem essencial para dar vida às páginas web, permitindo interatividade e efeitos dinâmicos."},
  {"palavra": "java", "dica": "Linguagem robusta e orientada a objetos, amplamente usada para desenvolvimento de aplicativos Android e software empresarial."},
  {"palavra": "html", "dica": "Linguagem de marcação que define a estrutura e o conteúdo das páginas web, como títulos, parágrafos e imagens."},
  {"palavra": "css", "dica": "Linguagem de estilo que controla a aparência visual das páginas web, como cores, fontes e layouts."},
  {"palavra": "sql", "dica": "Linguagem de consulta para gerenciar e extrair dados de bancos de dados relacionais, permitindo operações como SELECT, INSERT e UPDATE."},
  {"palavra": "react", "dica": "Biblioteca JavaScript popular para construir interfaces de usuário dinâmicas e responsivas, com foco em componentes reutilizáveis."},
  {"palavra": "angular", "dica": "Framework JavaScript completo para criar aplicativos web complexos, com recursos como injeção de dependência e roteamento."},
  {"palavra": "node", "dica": "Ambiente de tempo de execução JavaScript que permite executar código JavaScript fora do navegador, ideal para aplicativos de servidor."},
  {"palavra": "vue", "dica": "Framework JavaScript progressivo para construir interfaces de usuário, conhecido por sua curva de aprendizado suave e flexibilidade."},
  {"palavra": "ruby", "dica": "Linguagem dinâmica e orientada a objetos, popular por sua elegância e o framework Ruby on Rails para desenvolvimento web."},
  {"palavra": "php", "dica": "Linguagem de script amplamente usada para desenvolvimento web do lado do servidor, comumente associada a sistemas de gerenciamento de conteúdo como WordPress."},
  {"palavra": "c++", "dica": "Linguagem de programação de alto desempenho, utilizada para desenvolver sistemas operacionais, jogos e software de baixo nível."},
  {"palavra": "c#", "dica": "Linguagem orientada a objetos da Microsoft, utilizada para desenvolver aplicativos Windows, jogos e aplicativos web com o framework .NET."},
  {"palavra": "swift", "dica": "Linguagem moderna e intuitiva da Apple, projetada para desenvolver aplicativos para dispositivos iOS, macOS, watchOS e tvOS."},
  {"palavra": "kotlin", "dica": "Linguagem concisa e interoperável com Java, adotada pelo Google como a linguagem preferencial para desenvolvimento Android."},
  {"palavra": "tensorflow", "dica": "Biblioteca de código aberto para aprendizado de máquina, desenvolvida pelo Google, com ampla gama de ferramentas para construir e treinar modelos."},
  {"palavra": "pytorch", "dica": "Biblioteca de aprendizado profundo desenvolvida pelo Facebook, conhecida por sua flexibilidade e capacidade de construir redes neurais complexas."},
  {"palavra": "mongodb", "dica": "Banco de dados NoSQL orientado a documentos, que armazena dados em documentos JSON flexíveis, ideal para aplicações com dados não estruturados."},
  {"palavra": "postgresql", "dica": "Sistema de gerenciamento de banco de dados relacional de código aberto, conhecido por sua confiabilidade, extensibilidade e conformidade com SQL."},
  {"palavra": "docker", "dica": "Plataforma para desenvolvimento, envio e execução de aplicativos em contêineres, isolando-os do ambiente do sistema operacional."},
  {"palavra": "kubernetes", "dica": "Plataforma de orquestração de contêineres que automatiza a implantação, o dimensionamento e o gerenciamento de aplicativos em contêineres."},
  {"palavra": "git", "dica": "Sistema de controle de versão distribuído que rastreia alterações no código-fonte ao longo do tempo, facilitando a colaboração e o gerenciamento de versões."},
  {"palavra": "jupyter", "dica": "Ambiente interativo baseado na web que permite criar e compartilhar documentos que combinam código, visualizações e texto narrativo."},
  {"palavra": "r", "dica": "Linguagem e ambiente de programação para computação estatística e gráficos, amplamente utilizado para análise de dados e modelagem estatística."},
  {"palavra": "scala", "dica": "Linguagem de programação que combina programação funcional e orientada a objetos, projetada para ser concisa, escalável e eficiente."},
  {"palavra": "hadoop", "dica": "Framework de software de código aberto para armazenamento e processamento distribuídos de grandes conjuntos de dados em clusters de computadores."},
  {"palavra": "spark", "dica": "Framework de processamento de big data que oferece processamento em memória rápido e versátil para análise de dados em larga escala."},
  {"palavra": "arduino", "dica": "Plataforma de prototipagem eletrônica de código aberto, baseada em hardware e software fáceis de usar, para criar projetos eletrônicos interativos."},
  {"palavra": "raspberry", "dica": "Computador de placa única de baixo custo, popular para projetos de hobby, educação e aplicações embarcadas."},
  {"palavra": "linux", "dica": "Sistema operacional de código aberto amplamente utilizado em servidores, desktops e dispositivos embarcados, conhecido por sua flexibilidade e estabilidade."},
  {"palavra": "windows", "dica": "Sistema operacional da Microsoft, amplamente utilizado em computadores pessoais e servidores, conhecido por sua interface gráfica de usuário e compatibilidade com software."},
  {"palavra": "macos", "dica": "Sistema operacional da Apple para computadores Mac, conhecido por sua interface elegante, foco na criatividade e integração com outros dispositivos Apple."},
  {"palavra": "android", "dica": "Sistema operacional móvel de código aberto desenvolvido pelo Google, baseado em Linux, e amplamente utilizado em smartphones e tablets."},
  {"palavra": "ios", "dica": "Sistema operacional móvel da Apple para iPhone e iPad, conhecido por sua interface intuitiva, foco na privacidade e ecossistema de aplicativos."},
  {"palavra": "firebase", "dica": "Plataforma de desenvolvimento de aplicativos móveis e web do Google, que oferece serviços de backend, como banco de dados, autenticação e armazenamento."},
  {"palavra": "aws", "dica": "Plataforma de computação em nuvem abrangente da Amazon, que oferece uma ampla gama de serviços, como computação, armazenamento, bancos de dados e aprendizado de máquina."},
  {"palavra": "azure", "dica": "Plataforma de computação em nuvem da Microsoft, que oferece serviços semelhantes ao AWS, com foco em integração com tecnologias Microsoft."},
  {"palavra": "google", "dica": "Empresa multinacional de tecnologia que oferece uma ampla gama de produtos e serviços, incluindo pesquisa, e-mail, publicidade online e desenvolvimento de software."},
  {"palavra": "api", "dica": "Interface que permite que diferentes aplicações se comuniquem e compartilhem dados, definindo um conjunto de regras e especificações."},
  {"palavra": "rest", "dica": "Estilo arquitetônico para APIs web que utiliza métodos HTTP, como GET, POST, PUT e DELETE, para interagir com recursos."},
  {"palavra": "graphql", "dica": "Linguagem de consulta para APIs que permite aos clientes solicitar dados específicos de que precisam, reduzindo a sobrecarga de dados e melhorando a eficiência."},
  {"palavra": "oauth", "dica": "Protocolo de autorização aberto que permite que aplicativos acessem recursos de outros aplicativos em nome do usuário, sem compartilhar suas credenciais."}
]
